/******************************************************************************/
#ifndef _MGCAPABILITIES_H_
#define _MGCAPABILITIES_H_
/******************************************************************************/

#include "EnginePreqs.h"
#include "Singleton.h"

/******************************************************************************/
namespace MG
{
    /******************************************************************************/
    //性能检测
    /******************************************************************************/
    class MGCapabilities 
    {
    public:

        SINGLETON_INSTANCE( MGCapabilities )
        MGCapabilities();
        virtual ~MGCapabilities();

        ///性能检测, 提示不兼容引擎的地方
        virtual Bool check();

    protected:

        
    };

}

/******************************************************************************/

#endif
