/******************************************************************************/
#ifndef _IENTITYGROUP_H_
#define _IENTITYGROUP_H_
/******************************************************************************/

#include "MGEngineInterfacePreqs.h"

/******************************************************************************/

namespace MG
{

    /******************************************************************************/
    //游戏实体组接口
    /******************************************************************************/
    class IEntityGroup : public ISceneObject
    {
    public:

        // 得到实体数量
        virtual UInt                getEntityNum() = 0;
        /// 得到实体对象
        virtual IEntity*            getEntity(UInt index) = 0;

        /// 得到模型实体
        virtual IModelObject*       getModelObject() = 0;

    };

}

/******************************************************************************/
#endif
