/******************************************************************************/
#ifndef _ITERRAINDECAL_H_
#define _ITERRAINDECAL_H_
/******************************************************************************/

#include "MGEngineInterfacePreqs.h"

/******************************************************************************/

namespace MG
{

    /******************************************************************************/
    //地形贴花接口
    /******************************************************************************/
    class ITerrainDecal
    {
    public:

        /// 设置位置
        virtual void                    setPosition(Vec3& pos) = 0;
        /// 得到位置
        virtual Vec3&                   getPosition() = 0;
        
        /// 设置大小
        virtual void                    setSize(Flt size) = 0;
        /// 得到大小
        virtual Flt                     getSize() = 0;
        
        /// 设置可见度
        virtual void                    setVisible(Bool visible) = 0;
    };
    
    /******************************************************************************/
    //地形贴花集
    /******************************************************************************/
    class ITerrainDecalSet
    {
    public:

        /// 得到贴花接口
        virtual ITerrainDecal*          getDecal(UInt index) = 0;
        /// 得到贴花数量
        virtual UInt                    getDecalNum() = 0;

    };



}

/******************************************************************************/
#endif
