/******************************************************************************/
#ifndef _ITERRAINBLOCKOPERATIONMANAGER_H_
#define _ITERRAINBLOCKOPERATIONMANAGER_H_
/******************************************************************************/

#include "MGEngineInterfacePreqs.h"
#include "IEditorOperation.h"

/******************************************************************************/

namespace MG
{

    /******************************************************************************/
    //游戏批量增加实体接口
    /******************************************************************************/
    class ITerrainAddRegionOperationManager : public IEditorOperationManager
    {
    public:

    };

    /******************************************************************************/
    //游戏批量移除实体接口
    /******************************************************************************/
    class ITerrainRemoveRegionOperationManager: public IEditorOperationManager
    {
    public:

    };

}

/******************************************************************************/
#endif
