/******************************************************************************/
#ifndef _MOVEDUSTEFFECTCOLLECTION_H_
#define _MOVEDUSTEFFECTCOLLECTION_H_
/******************************************************************************/

#include "ClientPreqs.h"

/******************************************************************************/
namespace MG
{

    /******************************************************************************/
    //管理移动灰尘特效集合
    /******************************************************************************/
    class MoveDustEffectCollection
    {
    public:
        MoveDustEffectCollection();
        virtual ~MoveDustEffectCollection();


        
    };
}

#endif