
/******************************************************************************/

#ifndef _S_SPVEMAPMANAGER_H_
#define _S_SPVEMAPMANAGER_H_

/******************************************************************************/

#include "MapServerPreqs.h"
#include "SMapManager.h"

/******************************************************************************/

namespace MG
{


    /******************************************************************************/
    //  整个PVE世界地图管理器
    /******************************************************************************/
    class SPveMapManager : public SMapManager
    {
    public:

        SPveMapManager();
        virtual ~SPveMapManager();

        //-----------------------------------------------------------------------------------
        // Main
        //-----------------------------------------------------------------------------------

        virtual Bool            initialize(){return 0;}
        virtual Bool            unInitialize(){return 0;}
        virtual void            clear(){return ;}
        virtual void            update(Flt delta){return ;}

        //-----------------------------------------------------------------------------------
        // Base Data
        //-----------------------------------------------------------------------------------

		virtual	REGION_OBJ_TYPE getRegionType() const;
        


    };


}

#endif	