
/******************************************************************************/

#ifndef _S_STIROMAPMANAGER_H_
#define _S_STIROMAPMANAGER_H_

/******************************************************************************/

#include "MapServerPreqs.h"
#include "SMapManager.h"

/******************************************************************************/

namespace MG
{


    /******************************************************************************/
    //  整个新手村世界地图管理器
    /******************************************************************************/
    class STiroMapManager : public SMapManager
    {
    public:

        STiroMapManager();
        virtual ~STiroMapManager();

        //-----------------------------------------------------------------------------------
        // Main
        //-----------------------------------------------------------------------------------

        virtual Bool            initialize(){return 0;}
        virtual Bool            unInitialize(){return 0;}
        virtual void            clear(){return ;}
        virtual void            update(Flt delta){return ;}

        //-----------------------------------------------------------------------------------
        // Base Data
        //-----------------------------------------------------------------------------------

		virtual	REGION_OBJ_TYPE getRegionType() const;



    };


}

#endif	