/******************************************************************************/
#ifndef _H_SYSLOGNETPACKETPROCESSER_
#define _H_SYSLOGNETPACKETPROCESSER_
/******************************************************************************/
#include "SysLogNetPacket.h"
/******************************************************************************/
namespace MG
{
    /******************************************************************************/
    //帐号登入消息处理
    /******************************************************************************/
    class SysLogNetPacketProcesser
    {
    public:
        SINGLETON_INSTANCE(SysLogNetPacketProcesser);


    };
}
#endif